{
    "id": "avatar-zero",
    "name": "Avatar ZERO",
    "fullSentence": "What you choose is your avatar and yourself.",
    "keywords": [
        "CHOOSE",
        "GAME",
        "EXISTENCE",
        "AVATAR",
        "YOURSELF"
    ],
    "description": "A game that is about choice, also only about choice.",
    "image": "assets/projects/avatar-zero/cover.jpg",
    "year": "2025",
    "links": [
        {
            "label": "Steam",
            "url": "https://store.steampowered.com/app/3982600/Avatar_Zero/"
        },
        {
            "label": "BiliBili",
            "url": "https://www.bilibili.com/video/BV1jXpKzDETg/?spm_id_from=333.1387.homepage.video_card.click&vd_source=51955fc2a3da377e69923b557e6f69d1"
        }
    ],
    "content": "<video controls poster=\"assets/projects/avatar-zero/cover.jpg\" style=\"width: 100%; border-radius: 8px; margin: 2rem 0; border: 1px solid rgba(64, 143, 152, 0.3); box-shadow: 0 0 20px rgba(0,0,0,0.5);\"><source src=\"assets/projects/avatar-zero/Trailer.mp4\" type=\"video/mp4\">Your browser does not support the video tag.</video><h3>Speciall Controller??Choice Controller</h3><p>The game is played using a specially designed binary-choice controller. All the operations only require two buttons. The lighting effects interact closely with the game, providing a more meta gameplay experience and a stronger sense of choice. Developed based on Arduino.</p><video controls poster=\"assets/projects/avatar-zero/Controller.jpg\" style=\"width: 100%; border-radius: 8px; margin: 2rem 0; border: 1px solid rgba(64, 143, 152, 0.3); box-shadow: 0 0 20px rgba(0,0,0,0.5);\"><source src=\"assets/projects/avatar-zero/Controller.mp4\" type=\"video/mp4\">Your browser does not support the video tag.</video><p>Avatar Zero is a pixel-art, player-choice-driven interactive narrative game.</p><p>A human life is nothing but a succession of choices. Your choices, and those of everyone connected to you, determine how you exist. Suppose we understood the mechanics of human choice - could we then predict the fate of all existence?</p><p>To study this question, you become the test subject in a secret experiment. You face one binary choice after another - no more, no less - just two options. You must deliberate carefully, selecting the path that steers destiny toward your desired outcome.</p><p>...But do you truly have a choice? As whom are you making these decisions? For what purpose?</p><h3>Regarding choice, there is only choice.</h3><p>This is a game about choice. It is also a game where choice is the sole mechanic. Your entire interaction advances the narrative through binary decisions within the story.</p><p>Based on your choices, the narrative branches diverge. You must use your judgment to make the right decisions at critical junctures, steering the story toward your desired outcome and ultimately reaching the true ending.</p><h3>What constitutes the right choice?</h3><p>Among the options presented, some are ambiguous, some starkly divergent, and some even contradictory. You may encounter classic philosophical dilemmas. Your decisions determine the fates of the characters within the game.</p><h3>Enter a Dystopian Cyber World</h3><p>Through pixel art and text, the game paints a dystopian world. A protagonist with a tragic past, eerie classmates, and perplexing experiments - you will gradually uncover the truth through its narrative.</p>",
    "type": "Game"
}
